# diff() Method
The pandas.DataFrame.diff() method is used to calculate the difference between consecutive elements in a DataFrame along a specified axis (usually rows or columns). It's commonly used to compute the changes or increments between successive data points in a time series or sequential data.

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({"A":[5, 3, 6, 4],
                   "B":[11, 2, 4, 3], 
                   "C":[4, 3, 8, 5],
                   "D":[5, 4, 2, 8]})

In [3]:
df

   A   B  C  D
0  5  11  4  5
1  3   2  3  4
2  6   4  8  2
3  4   3  5  8

In [4]:
df.diff(axis=0)

     A    B    C    D
0  NaN  NaN  NaN  NaN
1 -2.0 -9.0 -1.0 -1.0
2  3.0  2.0  5.0 -2.0
3 -2.0 -1.0 -3.0  6.0

In [5]:
df.diff(axis=1)

    A  B  C  D
0 NaN  6 -7  1
1 NaN -1  1  1
2 NaN -2  4 -6
3 NaN -1  2  3

In [6]:
df

   A   B  C  D
0  5  11  4  5
1  3   2  3  4
2  6   4  8  2
3  4   3  5  8